Merge pull request #140 from itsiae/refactor/migrate-mermaid-to-plantuml
refactor: migrate diagram standard from Mermaid to PlantUML
